// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");


/* ЗАКЛЮЧИТЕЛЬНАЯ РАБОТА:
ЗАДАЧА: Написать программу, котороая из имеющегося массива строк формирует массив из строк, длина которых меньше
 либо равна 3 символам.
Первоначальный массив можно ввести с клаиватуры, либо задавть на старте выполнения алгоритма. 
При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

примеры:
["hello", "2", "world", ":-)"] -> ["2", ":-)"]
["1234", "1567", "-2", "computer science"] -> ["2"]
*/

Console.Clear();
